;; -*- no-byte-compile: t; -*-
(package! with-editor
          :pin "bbc60f68ac190f02da8a100b6fb67cf1c27c53ab"
          :recipe (:host github :repo "magit/with-editor"))
(package! transient
      :pin "c2bdf7e12c530eb85476d3aef317eb2941ab9440"
      :recipe (:host github :repo "magit/transient"))

(package! all-the-icons)
(package! beacon)
(package! elfeed-org)
(package! elfeed-goodies)
(package! cl-libify)
(package! pinentry)
(package! libmpdel)
(package! mpdel)
(package! ivy-mpdel)
(package! fancy-battery)
(package! org-fancy-priorities)
(package! org-modern)
